Prettier diagram
